const finalExam = [
    {
        q: "صياغة تعبر بدقة وضوح عن التغير المرجو حدوثه في شخصية التلميذ نتيجة مروره بخبرة تعليمية معينة المصطلح الدال على المفهوم السابق هو ",
        options: [
            "أ-المحتوى التعليمي",
            "ب-الهدف التعليمي",
            "ج-النشاط التعليمي",
            "د-الوسيلة التعليمية"
        ],
        right: 1, // ترتيب الإجابة الصحيحة يبدأ من 0 (يعني الاختيار الثاني هو الصحيح)
        type: "text"
    },
    {
        q: "يُمثّل معمل العلوم وسيلة تعليمية جماعية نظرًا لأنه يُستخدم لــ ",
        options: [
            "أ-مجموعة صغيرة من المتعلمين في مكان محدد ووقت محدد",
            "ب-مجموعة كبيرة من المتعلمين في أماكن مختلفة ووقت محدد",
            "ج-مجموعة صغيرة من المتعلمين في أماكن مختلفة ووقت محدد",
            "د-مجموعة كبيرة من المتعلمين في أماكن مختلفة وأوقات مختلفة"
        ],
        right: 0, 
        type: "text"
    },
    {
        q: "يُمثّل الشكل وسيلة تعليمية",
        qImg: "pic/1.png", // مسار صورة السؤال
        options: [
            "أ-بصريَّــــــــــــــــــــــة",
            "ب-فرديَّـــــــــــــــــــــــــــة",
            "ج-مُصنعـــــــــــــــــة",
            "د-البديلين أ و ج"],
        right: 3,
        type: "text"
    },
    {
        q: "بتحليل الموقف التعليمي التالي.. بدأ المعلم الحصة بطرح العبارة التالية (أنا حارس جسمك الخفي، أتعرف على الجراثيم وأهاجمها لأحميك كم الأمراض.. فمن أكون)، وفي ضوء تفاعل التلاميذ مع المعلم تم استنباط عنوان الحصة وهو(الجهاز المناعي)، ثم انتقل لشرح المعلومات ذات الصلة به؛ حيث ذكر فيروس كورونا وناقش مع طلابه تباين قدرة الناس على مقاومته، ليتوصل من خلال ذلك لأهمية الجهاز المناعي في حماية الجسم من الأمراض، ثم أشار إلى حملة التطعيم الحديثة التي تتم حاليًّا في المدينة، وترتب على ذلك التوصل لدور اللقاح في تعزيز استجابة الجهاز المناعي، وفي نهاية الحصة أخبر المتعلمين أنه انتهى من الشرح، وعليهم الاستعداد لمشاركته في تلخيص ما تم اكتسابه من أفكار، من خلال اكمال فراغات مخطط سيقوم بعرضه لهم، نجد أن أشكال التمهيد المتضمنة به على التوالي هي ",
        options: [
            "أ-لغز تعليمي، قصة قصيرة، حدث جاري، خريطة مفاهمية",
            "ب-سؤال، مشكلة بسيطة، قصة قصيرة، خريطة مفاهيمية",
            "ج-لغز تعليمي، حدث جاري، عرض عملي، خريطة مفاهيمية",
            "د-مشكلة بسيطة، قصة قصيرة، حدث جاري، لغز تعليمي"
        ],
        right: 0, 
        type: "text"
    },
    {
        q: "محور العملية التعليمية عند استخدام أسلوب (المحاضرة القصيرة) هو .......",
        options: [
            "أ-المعلم",
            "ب-المتعلم",
            "ج-بيئة التعلم",
            "د-محتوى التعلم"
        ],
        right: 0, 
        type: "text"
    },
    {
        q: "تعتبر المعلومة (يجذب المغناطيس الحديد والنيكل والكوبالت) حقيقة، نظرًا لامكانية .....",
        options: [
            "أ- ملاحظتها بواسطة ملاحظ واحد فقط.",
            "ب-دعم ملاحظتها بأدوات موثوق فيها.",
            "ج- استدعائها وملاحظتها بصورة متكررة.",
            " د- الإجابتان ب+ ج كلاهما صحيحتان ."
        ],
        right: 3, 
        type: "text"
    },
    {
        q: "لكي تجدي جلسة (العصف الذهني) نفعًا؛ فإنَّ أبرز قواعدها.......",
        options: [
            "أ-التقييم أثناء طرح الأفكار.",
            "ب-التركيز على كم الأفكار.",
            "ج-الاهتمام بمضمون الأفكار.",
            "د-تجنب البناء على الأفكار."
        ],
        right: 1, 
        type: "text"
    },
    {
        q: "من أمثلة الأنشطة الصفية ذات الصلة بمبدأ التفويض: ",
        options: [
            "أ- تكليف تلميذ ما بمسح السبورة كل حصة بعد انتهاء شرح المعلم.",
            "ب- الاتفاق مع التلاميذ بعدم دخولهم للفصل بعد بداية الحصة.",
            "ج- تكليف تلميذ ما بتسجيل استعارة وارجاع الكتب من مكتبة الفصل.",
            " د- البديلان (أ)+ (ج) كلاهما صحيح. "
        ],
        right: 3, 
        type: "text"
    },
    {
        q: "بتحليل الموقف التعليمي التالي: (عرض المعلم في بداية الحصة صورة للجهاز الهضمي وطلبت من التلاميذ تسمية ما يعرفونه من أجزاء ووظائف لتلك الأجزاء، وأثناء الحصة بعد قيامه بشرح وظيفة كل جزء ركَّز على طرح سؤال متعلّق به قبل أن ينتقل للجزء الذي يليه مع اهتمامه بمناقشة الإجابات وتصحيح الأخطاء أولًا بأول، وبعد انتهاء الدرس تمامًا اختبارًا شاملًا عن أجزاء الجهاز الهضمي ووظيفة كل جزء)، نجد أن أنواع التقويم المتضمنة به على التوالي هي: ",
        options: [
            "أ- التكويني، القبلي، التجميعي.",
            "ب- القبلي، البنائي، النهائي.",
            "ج- التجميعي، البنائي، القبلي.",
            " د- القبلي، البنائي، التكويني."
        ],
        right: 1, 
        type: "text"
    },
    {
        q: "يمثل ملف الانجاز إحدى وسائل التقويم الشامل للمتعلم، نظرًا لأنه يثمر عن: ",
        options: [
            "أ- رسم صورة مستقبلية لطبيعة الأداء الذي ينبغي تحقيقه.",
            "ب- تجميع معلومات عن الجو الأسرى وأثره على تحصيله.",
            "ج-تقديم صورة واقعية متكاملة عن أدائه طوال العام الدراسي.",
            "د- التعرف على أي اعاقات جسدية أو نفسية تعوق تحصيله."
        ],
        right: 2, 
        type: "text"
    },
    {
        q: "من الشروط التي ينبغي مراعاتها عند تصحيح الواجب المنزلي: ",
        options: [
            "أ- تأجيل الثناء على الواجبات المتميزة.",
            "ب- كتابة كلمة (نظر مع الشكر والتقدير).",
            "ج- الوقوف عند الخطأ الشائع وتصويبه.",
            " د- تصحيحه لجميع الطلاب في وقت واحد. "
        ],
        right: 2, 
        type: "text"
    },
    {
        q: "الدرجة العظمى لمقياس ثلاثي التدرج، يتضمن (15) عبارة إيجابية، و(15) عبارة سلبية: ",
        options: [
            "أ- 90 درجة.",
            "ب- 60 درجة.",
            "ج- 30 درجة.",
            " د- 180 درجة."
        ],
        right: 0, 
        type: "text"
    },
    {
        q: "من وسائل التقويم الشامل التي لا تدخل درجاتها ضمان نجاح المتعلم أو رسوبه: ",
        options: [
            "أ- الأنشطة الصفية.",
            "ب- الأنشطة اللاصفية.",
            "ج- ملف الانجاز.",
            " د- اختبار نهاية الفصل."
        ],
        right: 1, 
        type: "text"
    },
    {
        q: "لابد أن يكون هناك تباينا في حجم التعزيز المقدم للمتعلمين، نظرًا لأن ذلك: ",
        options: [
            "أ- يقلل شعور المتعلمين بالتوتر والإرتباك.",
            "ب- يحمل قدرًا من الإنصــاف والعدالـــة.",
            "ج-يدل على مزيد من الدهشة والإعجاب.",
            "د- يزيد معدل عشوائية الإجابات المقدمة."
        ],
        right: 1, 
        type: "text"
    },
    {
        q: "يمكن استنتاج عنوان الدرس أثناء تنفيذ التهيئة:",
        options: [
            "أ- الاستهلالية.",
            "ب- الانتقالية.",
            "ج- التقويمية.",
            " د- التدريجية. "
        ],
        right: 0, 
        type: "text"
    },
    {
        q:  "بتحليل الموقف التعليمي التالي: (ذكر المعلم في بداية الحصة أن (الحرارة تنتقل من الجسم الساخن للجسم البارد)، ثم أحضر كوب شاي ساخن ووضع به ملعقة معدنية باردة, وطلب من التلاميذ لمسها فلاحظوا معًا أن الملعقة تسخن تدريجيًّا)، نجد أن طبيعة نشاط التعلم الممثل له تكمن في: ",
        options: [
            "أ- الابتداء بالخاص والانتهاء بالعام.",
            "ب- الابتداء بالجُزء والانتهاء بالكلّ.",
            "ج- الابتداء بالمجهول والانتهاء بالمعلوم.",
            " د- الابتداء بالكل والانتهاء بالجزء."
        ],
        right: 3, 
        type: "text"
    },
    {
        q: "يتمكن المعلم من تنمية النواحي الإيجابية وتعديل النواحي السلبية في سلوك المُتعلم؛ إذا أتقن مهارة:",
        options: [
            "أ- التمهيد.",
            "ب- التقييم.",
            "ج- التعزيز.",
            " د- التخطيط."
        ],
        right: 2, 
        type: "text"
    },
    {
        q: "يعبر عن الغلق التخطيطي الصحيح لــ (مسار الطعام في جسم الإنسان) بالشكل: ",
        options: [
            "pic/2.png",
            "pic/3.png",
            "pic/4.png",
            "pic/5.png"
        ],
        right: 0, 
        type: "image" // لو السؤال فيه صور بدل نصوص
    },
    {
        q: "يعد الهدف: )اكساب التلاميذ معلومات عن البيئات المختلفة( هدفا عامًّا، نظرًا لأنــه: ",
        options: [
            "أ- بعيد في مدى التحقيق.",
            "ب-قابل للملاحظة والقياس.",
            "ج- اعداده مسؤولية المتعلم.",
            " د- درجة عموميته منخفضة."
        ],
        right: 0, 
        type: "text"
    },
    {
        q: "(تحليل المادة العلمية للدرس؛ لتحديد أوجه التعلم المطلوبة التي يتم وضع الأهداف السلوكية في ضوئها) المصطلح العلمي الأنسب للمفهوم السابق هو: ",
        options: [
            "أ-فهم المحتوى.",
            "ب-تقويم المحتوى.",
            "ج-تركيب المحتوى.",
            "د-تحليل المحتوى."
        ],
        right: 3, 
        type: "text"
    },
    {
        q: "تختلف (الطريقة الكلّية) المُستخدمة في تقويم الجانب المهاري للمتعلمين عن (الطريقة التحليلية) في تركيزها على: ",
        options: [
            "أ- تقويم ناتج العمل.",
            "ب- تقديم تغذية راجعة.",
            "ج- تقويم خطوات الأداء.",
            " د- قياس المهارات الفرعية."
        ],
        right: 0, 
        type: "text"
    },
    {
        q: "يفضل تجنب استخدام أسلوب (المناقشة) مع المناهج الطويلة المكتظة بالمعلومات، نظرًا لأنه: ",
        options: [
            "أ- يزيد شعور المتعلم بالسلبية والملل.",
            "ب- يستغرق وقتًا طويلًا في تنفيذه.",
            "ج- يخفف من جهد المعلم المبذول.",
            " د- يستغرق وقتًا قصيرًا في تنفيذه."
        ],
        right: 1, 
        type: "text"
    },
    {
        q: "بتحليل الهدف التالي: (أن يكتسب التلميذ مهارات التفكير المتنوعة التي تعينه على فهم بيئته ومواكبة ما يطرأ عليها من تطورات وتغيرات متسارعة)؛ فإن مصادر اشتقاقه تكمن في:",
        options: [
            "أ- المجتمع، طبيعة المادة الدراسية، البيئة.",
            "ب- البيئة، طبيعة التلميذ، طبيعة المادة الدراسية.",
            "ج- طبيعة المادة الدراسية، المجتمع، البيئة.",
            "د- طبيعة التلميذ، المجتمع، البيئة."
        ],
        right: 3, 
        type: "text"
    },
    {
        q: "تنتمي أسئلة الاختيار من متعدد وأسئلة الصواب والخطأ لنوع الأسئلة الموضوعية، نظرًا لـــ: ",
        options: [
            "أ- تباين درجاتها عند اختلاف أوقات تصحيحها.",
            "ب- قابليتها لتباين النتيجة عند اختلاف المصحح.",
            "ج- عدم اعتماد درجاتها على ذاتية المصحح.",
            " د- عدم حاجتها لمفتاح تصحيح أو نموذج اجابة."
        ],
        right: 2, 
        type: "text"
    },
    {
        q: "من الشروط الواجب توافرها في أي وسيلة تعليمية:",
        options: [
            "أ-المتانة وصغر الحجم بشكل دائم.",
            "ب-حداثة وصحة المعلومات بها.",
            "ج-غياب العنوان وسهولة الاستخدام.",
            "د-وضوح كتابتها وبهرجة ألوانها."
        ],
        right: 1, 
        type: "text"
    },
    {
        q: "الأداءات العملية والمناقشات الصفية من محتويات ملف الإنجاز الرئيسة، نظرًا لأهميتها في تعزيز: ",
        options: [
            "أ- علاقات المدرسة بالمؤسسات الاجتماعية في البيئة المحلية.",
            "ب- كلا من جوانب القوة والضعف لدى المتعلم؛ فيزيد تحصيله.",
            "ج- علاقات المدرسة بأولياء الأمور؛ فيتابعون معدل نمو أبناءهم.",
            "د- الفهم المتعمق للمفاهيم وتصويب التصورات الخاطئة عن بعضها."
        ],
        right: 3, 
        type: "text"
    },
    {
        q: "يختلف (غلق التنقل (عن) غلق الخاتمة)، بأنه يتم:",
        options: [
            "أ- في نهاية شرح فكرة وقبل الانتقال للأخرى.",
            "ب- أكثر من مرة في الحصة الواحدة.",
            "ج- قرب نهاية الوقت المحدد للحصة.",
            " د- البديلان (أ)+ (ب) كلاهما صحيح."
        ],
        right: 3, 
        type: "text"
    },
    {
        q: "من أمثلة الأهداف السلوكية: ",
        options: [
            "أ- (أن يكتسب التلميذ صفة الولاء والانتماء للوطن).",
            "ب-(أن يقدر الطالب عظمة الخالق- عزَّ وجلّ- وابداعه في خلقه).",
            "ج- (أن يحدد التلميذ أوجه التباين بين الأميبا والبراميسيوم).",
            "د-(أن يهتم الطالب بتنمية مهاراته العليا في التفكير والابداع)"
        ],
        right: 2, 
        type: "text"
    },
    {
        q: "يترتب على اختيار (المدخل التسامحي) في ادارة الفصل (حدوث الفوضى أحيانا)، نظرًا لأنه: ",
        options: [
            "أ- يقوم على تغاضي المعلم عن سلوكيات سلبية.",
            "ب- يتيح للمعلم خلق جو اجتماعي انفعالي ممتع.",
            "ج-يزيد من حرية المتعلمين إلى أقصى حد ممكن.",
            "د- يرتكز على تحرير المعلم من قيامه بأدواره."
        ],
        right: 2, 
        type: "text"
    },
    {
        q: "يقدم المعلم (اللعبة التربوية) داخل الصف وفق ثلاث مراحل مرتبة على التوالي كما يلي:  ",
        options: [
            "أ- الاعداد، التقويم، الاستخدام.",
            "ب- الاستخدام، الاعداد، التقويم.",
            "ج- الاعداد، الاستخدام، التقويم.",
            "د- التقويم، الاستخدام، الاعداد."
        ],
        right: 2, 
        type: "text"
    },
    {
        q: "(بدأ المعلم الحصة بعرض فيديو تعليمي لتجربة احتراق شمعة داخل اناء زجاجي, وناقش التلاميذ فيما لاحظوه حتى توصلوا معًا إلى سبب انطفاء الشمعة)، نوع النشاط المُستخدم في الموقف التعليمي السابق هو:",
        options: [
            "أ- الاستقراء.",
            "ب-الاستنتاج.",
            "ج- المحاضرة.",
            " د-تمثيل الأدوار."
        ],
        right: 0, 
        type: "text"
    },
    {
        q: "يعدّ تقويم التحصيل الدراسي أمرًا ضروريًّا، نظرًا لفاعليته في: ",
        options: [
            "أ- تشخيص نواحي القوة دون نواحي الضعف.",
            "ب- تحفيز المعلمين على تثبيت طرق تدريسهم.",
            "ج-تشخيص نواحي الضعف دون نواحي القوة.",
            " د- زيادة دافعية المتعلم للتحصيل الدراسي."
        ],
        right: 3, 
        type: "text"
    },
    {
        q: "يعبِّر (إنتاج حلول جديدة وبناء تصور متكامل) عن طبيعة الأداء العقلي الكامن في سؤال مُصاغ وفقًا لمستوى: ",
        options: [
            "أ-التطبيق.",
            "ب-التركيب.",
            "ج-التقويم.",
            "د-التحليل."
        ],
        right: 1, 
        type: "text"
    },
    {
        q: "(نفذ المعلم تجربة احتراق شريط المغنيسيوم أمام تلاميذه، ثم طلب منهم ملاحظة التغيرات الفيزيائية والكيميائية، ثم مناقشة التغيرات ومقارنتها بالتوقعات) نوع النشاط المُستخدم في الموقف التعلميمي السابق هو:",
        options: [
            "أ- أداء عملي.",
            "ب-لعبة تربوية.",
            "ج- عرض عملي.",
            " د-تعلم تعاوني."
        ],
        right: 2, 
        type: "text"
    },
    {
        q: "ينبغي عدم المبالغة في استخدام أساليب التعزيز السلبي، نظرًا لأن ذلك يعوق: ",
        options: [
            "أ- علاج صفة العناد والشغب في الفصل.",
            "ب- الإضرار بأثاث المدرسة وممتلكاتها.",
            "ج-تكوين المشاعر السلبية نحو المعلم.",
            "د- اكتساب صفة الكذب والسرقة."
        ],
        right: 0, 
        type: "text"
    },
    {
        q: "المرحلة الأخيرة في تنفيذ الدرس هي: ",
        options: [
            "أ- الغلــــق (الخاتمة).",
            "ب- تقديم الواجب.",
            "ج- توجيه الأسئلة.",
            " د- استخدام الوسيلة. "
        ],
        right: 0, 
        type: "text"
    },
    {
        q: "يتباين مدخل (عمليات الجماعة) عن مدخل (الجو الاجتماعي) في ارتكازه على: ",
        options: [
            "أ- الانضمام لجماعة الإذاعة.",
            "ب- تكوين علاقات صحيحة.",
            "ج- استخدام التعلم التعاوني.",
            " د- عقد اجتماعا مع المتعلمين."
        ],
        right: 2, 
        type: "text"
    },
    {
        q: "الصيغة الممثلة لــ (سؤال الموحي بالإجابة) من بين الأسئلة المطروحة التالية هي:",
        options: [
            "أ- (تحدَّث عن الكربوهيدرات؟).",
            "ب- (الكربوهيدرات ضرورية، أليس كذلك).",
            "ج- (عرّف الكربوهيدرات، واذكر أنواعها).",
            " د- (ما رأيك في الكربوهيدرات؟)."
        ],
        right: 1, 
        type: "text"
    },
    {
        q: "من خصائص الاختبار التحصيلي الجيّد: ",
        options: [
            "أ-التجانس.",
            "ب-التدرج.",
            "ج-الذاتية.",
            "د-المحدودية."
        ],
        right: 1, 
        type: "text"
    },
    {
        q: "التصرف الملائم مع تلميذ دائم التعالي والتكبر والتقليل من قدرات زملائه، هو: ",
        options: [
            " أ- عدم الالتفات له؛ فتصرفاته لا تعنيني.",
            "ب- توبيخه بقسوة أمام الآخرين بشكل علني.",
            "ج- توعيته بثمار التحلي بسمة التواضع.",
            " د- الحد من اشراكه في الأنشطة الجماعية. "
        ],
        right: 2, 
        type: "text"
    },
    {
        q: "يتميز أسلوب (الأداء العملي) عن أسلوب (العرض العملي) بدوره البارز في: ",
        options: [
            "أ- توفير وقت وجهد كلًّا من المعلم والمتعلم.",
            "ب- تنمية المهارات العملية لدى المتعلمين.",
            "ج- اكساب الجميع قدر مشترك من الخبرات.",
            " د- الحدّ من خطورة بعض التجارب العملية."
        ],
        right: 1, 
        type: "text"
    },
    {
        q: "يمكن التوصل إلى عنوان: (الطفو والغمر) بسهولة، من خلال التمهيد الممثَّل بــ(العرض العملي) التالي:",
        options: [
            "أ- اذكر أمثلة الأجسام التي طفت وغُمرت في تجربة الدرس السابق؟",
            "ب- قصة الصيادون الذين لاحظوا طفو بعض القوارب وغرق بعضها الآخر بالنيل.",
            "ج- يضع المعلم بيضة في ماء عادي، وأخرى بماء مالح، لملاحظة الطفو والغوص وتفسيره.",
            " د- شئ يطفو على الماء لكنه يغرق إذا غرق الماء نفسه ماهو؟"
        ],
        right: 2, 
        type: "text"
    },
    {
        q: "إذا كان الاختبار مكون من (80) سؤال من نوع الصواب والخطأ، وأجاب التلميذ عن (50) منها اجابة صائبة، وترك الباقي بلا إجابة؛ فإنَّ درجته من أثر التخمين تساوي: ",
        options: [
            "أ- 50 درجة.",
            "ب-40 درجة.",
            "ج- 30 درجة.",
            " د-20 درجة."
        ],
        right: 3, 
        type: "text"
    },
    {
        q: "يُلزَم المعلم بعدم ترحيل تدريس نشاط ما يُرجي تنفيذه إلى حصة أخرى، تحقيقًا لمبدأ: ",
        options: [
            "أ- التفويض.",
            "ب- التشاور.",
            "ج- عدم التأجيل.",
            " د- التعاقد."
        ],
        right: 2, 
        type: "text"
    },
    {
        q: "يمر (التعميم) كعملية عقلية في تكوينه بثلاث مراحل مرتبة تصاعديًّا على النحو التالي: ",
        options: [
            "أ- ملاحظة الحقائق، تكوين علاقات بين الحقائق، صياغة العلاقات في صورة جمل.",
            "ب- تكوين علاقات بين الحقائق، صياغة العلاقات في صورة جمل، ملاحظة العلاقات.",
            "ج- تكوين الحقائق، صياغة العلاقات في صورة جمل، ملاحظة العلاقات بين الحقائق.",
            "د- ملاحظة العلاقات بين الحقائق، صياغة العلاقات في صورة جمل، ملاحظة الحقائق."
        ],
        right: 0, 
        type: "text"
    },
    {
        q: "وجه التعلم الممثل لمعلومة (الوعي بأهمية المحافظة على البيئة من التلوث) هو: ",
        options: [
            "أ- مهارة.",
            "ب-اتجاه.",
            "ج- حقيقة.",
            " د-تعميم."
        ],
        right: 1, 
        type: "text"
    },
    {
        q: "تُقسَّم الوسائل التعليمية وفقًا لعدد المستفيدين إلى:  ",
        options: [
            "أ- جاهزة، مُصنَّعة، طبيعيَّة النَّشأة.",
            "ب- تُعرض بواسطة أجهزة، تُعرض بذاتها.",
            "ج- فرديَّة، جماعيَّة، جماهيريَّة.",
            "د- سمعيَّة، بصريَّة، سمعية بصرية."
        ],
        right: 2, 
        type: "text"
    },
       {
        q: "يكون حجم مجموعة التعلم التعاوني الواحدة: (3- 6) تلاميذ، نظرًا لفاعلية هذا العدد في: ",
        options: [
            "أ- زيادة التباين بين أفراد المجموعة.",
            "ب- انتشار الفوضى داخل المجموعة.",
            "ج- تعزيز الشعور بالانتماء للمجموعة.",
            " د- توليد التنافر بين أعضاء المجموعة."
        ],
        right: 2, 
        type: "text"
    },
    {
        q: "يمثل استخدام أسلوب التأديب والعقاب والتهديد، جوهر إدارة الفصل وفق المدخل: ",
        options: [
            "أ- الاجتماعي.",
            "ب-الديموقراطي.",
            "ج-السلوكي.",
            "د-التسلطي."
        ],
        right: 3, 
        type: "text"
    },
 
    {
        q: "يُمثّل (الميكروسكوب الإلكتروني) جهازًا تعليميًّا وليس مادّة تعليمية، نظرًا لأنه: ",
        options: [
            "أ- يساعد على نقل المعارف المتنوعة للمتعلمين.",
            "ب-يُستخدم لعرض محتوى المادة التعليمية.",
            "ج- يحمل ويخزّن ويحتفظ بالمحتوى التعليمي.",
            " د- ينمّي أساليب التفكير المختلفة لدى المتعلمين ."
        ],
        right: 1, 
        type: "text"
    }
]