const finalExam = [
    {
        q: "طرح أكبر عدد من الاحتمالات والفروض يتيح للمتعلم فرصة اختيار أمثلها لحل الموقف المشكل",
        options: [
            "موافق",
            "غير متأكد",
            "غير موافق",
        ],
        scores: [3, 2, 1],
        type: "text"
    },
    {
        q: "يتميز الفرد المبتكر بقدرته على تقديم أكبر عدد ممكن من الأفكار الابداعية في فترة زمنية قصيرة",
        options: [
            "موافق",
            "غير متأكد",
            "غير موافق",
        ],
        scores: [3, 2, 1],
        type: "text"
    },
    {
        q: "كم الأفكار الابداعية المنبثقة عن التفكير الفردي أكبر من تلك المنبثقة عن التفكير الجماعي.",
        options: [
            "موافق",
            "غير متأكد",
            "غير موافق",
        ],
        scores: [3, 2, 1],
        type: "text"
    },
    {
        q: "تتضمن طلاقة الأفكار: انتاج فكرة ابداعية واحدة, ثم التعبير عنها بأكبر كم من الطرق والأشكال",
        options: [
            "موافق",
            "غير متأكد",
            "غير موافق",
        ],
        scores: [3, 2, 1],
        type: "text"
    },
    {
        q: "يثمر التفكير المستدام عن انتاج عدد أكبر من الحلول الفاعلة للمشكلات الأكاديمية المطروحة.",
        options: [
            "موافق",
            "غير متأكد",
            "غير موافق",
        ],
        scores: [3, 2, 1],
        type: "text"
    },
    {
        q: "يسهم تنويع أساليب واستراتيجيات التفكير لمواجهة مشكلة متكررة الحدوث في زيادة مرات ظهورها ",
        options: [
            "موافق",
            "غير متأكد",
            "غير موافق",
        ],
        scores: [3, 2, 1],
        type: "text"
    },
    {
        q: "ينعكس الانتقال بين مصادر التعلم المختلفة بشكل سلبي على التنوع الفكري الابداعي للمتعلم.",
        options: [
            "موافق",
            "غير متأكد",
            "غير موافق",
        ],
        scores: [3, 2, 1],
        type: "text"
    },
    {
        q: "يسعى المتعلم إلى تعديل أفكاره واعادة صياغتها بما يتلاءم مع متطلبات ومتغيرات بيئة التعلم.",
        options: [
            "موافق",
            "غير متأكد",
            "غير موافق",
        ],
        scores: [3, 2, 1],
        type: "text"
    },
    {
        q: "يقود التنقل المرن بين أفكار الماضي والحاضر إلى رؤية المشكلة بأكثر من منظور فكري وزمني",
        options: [
            "موافق",
            "غير متأكد",
            "غير موافق",
        ],
        scores: [3, 2, 1],
        type: "text"
    },
    {
        q: "يثبط تقبل وجهات النظر المختلفة تنوُّع الأفكار, وتحويل غير النافع منها إلى مسار فكري متجدد",
        options: [
            "موافق",
            "غير متأكد",
            "غير موافق",
        ],
        scores: [3, 2, 1],
        type: "text"
    },
    {
        q: "يرتكز التفكير الترابطي على الدمج بين أكثر من فكرة لإنتاج معانٍ مألوفة وتقديم حلولًا متوقعة. ",
        options: [
            "موافق",
            "غير متأكد",
            "غير موافق",
        ],
        scores: [3, 2, 1],
        type: "text"
    },
    {
        q: "تدلّ صياغة الاستنتاجات بأسلوب شخصي مبتكر مخالف للآخرين على شخصية مستقلة بتفكيرها",
        options: [
            "موافق",
            "غير متأكد",
            "غير موافق",
        ],
        scores: [3, 2, 1],
        type: "text"
    },
    {
        q: "يميل الشخص المبدع لكسر نمط التفكير السائد وتطوير فكره حتى لو تطلَّب ذلك مزيدًا من الجهد",
        options: [
            "موافق",
            "غير متأكد",
            "غير موافق",
        ],
        scores: [3, 2, 1],
        type: "text"
    },
    {
        q: "يقود التفكير التأملي لاكتشاف زوايا فريدة والوصول لتفسيرات أصيلة تعوق فهم الظواهر التربوية.",
        options: [
            "موافق",
            "غير متأكد",
            "غير موافق",
        ],
        scores: [3, 2, 1],
        type: "text"
    },
    {
        q: "يحفز الفرد ذاته على تقديم وجهات نظر جديدة وتوليد رؤى مبتكرة في قضايا تم التطرق لها سابقا",
        options: [
            "موافق",
            "غير متأكد",
            "غير موافق",
        ],
        scores: [3, 2, 1],
        type: "text"
    },
    {
        q: "ربط الفكرة بأمثلة وشواهد تفصيلية ورسوم ومخططات توضيحية يعزز استيعابها ويدعم بقاء أثرها.",
        options: [
            "موافق",
            "غير متأكد",
            "غير موافق",
        ],
        scores: [3, 2, 1],
        type: "text"
    },
    {
        q: "ايضاح السياق التفصيلي للفكرة  يجعلها أقل ثراءًا وشمولًا, مما يمنع تطبيقها أو اعادة بلورتها.",
        options: [
            "موافق",
            "غير متأكد",
            "غير موافق",
        ],
        scores: [3, 2, 1],
        type: "text"
    },
    {
        q: "يقود تفسير المصطلحات والمفاهيم العلمية إلى اضفاء مزيدًا من الغموض والتداخل بين معانيها",
        options: [
            "موافق",
            "غير متأكد",
            "غير موافق",
        ],
        scores: [3, 2, 1],
        type: "text"
    },
    {
        q: "يشجع تحليل الأفكار الكبرى لمكوناتها الفرعية على تقريب معناها وفهم مضمونها بعــمق ودقـة.",
        options: [
            "موافق",
            "غير متأكد",
            "غير موافق",
        ],
        scores: [3, 2, 1],
        type: "text"
    },
    {
        q: "يتجنب المتعلم اضافة تعليقات وشروح اضافية عندما يجد أن الفكرة بحاجة لمزيد من الايضاح.",
        options: [
            "موافق",
            "غير متأكد",
            "غير موافق",
        ],
        scores: [3, 2, 1],
        type: "text"
    },
    {
        q: "جوهر التنفيذ الابداعي هو تحويل الأفكار النظرية المبتكرة إلى واقع ملموس قابل للتطبيق العملي.",
        options: [
            "موافق",
            "غير متأكد",
            "غير موافق",
        ],
        scores: [3, 2, 1],
        type: "text"
    },
    {
        q: "يقود استثمار موارد بيئة التعلم بشكل غير تقليدي إلى عرقلة تنفيذ المهام التعليمية بطرق مبتكرة.",
        options: [
            "موافق",
            "غير متأكد",
            "غير موافق",
        ],
        scores: [3, 2, 1],
        type: "text"
    },
    {
        q: "يدمج المتعلم أساليب تعلم مبتكرة ضمن أنشطة التعلم كوسيلة فاعلة في تطبيق الأفكار الابداعية",
        options: [
            "موافق",
            "غير متأكد",
            "غير موافق",
        ],
        scores: [3, 2, 1],
        type: "text"
    },
    {
        q: "يبتكر المتعلم حلولا عملية متطورة لتجاوز التحديات التي تواجهه أثناء تنفيذ الأنشطة التعليمية.",
        options: [
            "موافق",
            "غير متأكد",
            "غير موافق",
        ],
        scores: [3, 2, 1],
        type: "text"
    },
    {
        q: "تتيح الطرق المبتكرة للتقويم الذاتي فرصة التأكد من تحقق أهداف التعلم المنشودة بكفاءة منخفضة ",
        options: [
            "موافق",
            "غير متأكد",
            "غير موافق",
        ],
        scores: [3, 2, 1],
        type: "text"
    },
    {
        q: "يرتب المتعلّم مستويات جهوده ويعيد تنظيم خطوات تعلّمه بما يتوافق مع تغيرات متطلبات المهمة",
        options: [
            "موافق",
            "غير متأكد",
            "غير موافق",
        ],
        scores: [3, 2, 1],
        type: "text"
    },
    {
        q: "يتبنى المتعلم آلية عمل واحدة ثابتة تناسب الطبيعة المتباينة للأدوار الموكلة له داخل فرق التعلم.",
        options: [
            "موافق",
            "غير متأكد",
            "غير موافق",
        ],
        scores: [3, 2, 1],
        type: "text"
    },
    {
        q: "يتضمن التقبل الايجابي للتغذية الراجعة تعديل المتعلم لمعايير تقييمه الذاتي وثبات أداؤه وفقًا لها.",
        options: [
            "موافق",
            "غير متأكد",
            "غير موافق",
        ],
        scores: [3, 2, 1],
        type: "text"
    },
    {
        q: "يوازن المتعلم بين سرعة الإنجاز وجودة الأداء دون فقد الحافز وفقًا لدرجة صعوبة وتعقيد المهمة. ",
        options: [
            "موافق",
            "غير متأكد",
            "غير موافق",
        ],
        scores: [3, 2, 1],
        type: "text"
    },
    {
        q: "التعديل التلقائي للاستراتيجيات التعليمية هو نهج سلبي في مواجهة صعوبات أداء أنشطة التعلم.",
        options: [
            "موافق",
            "غير متأكد",
            "غير موافق",
        ],
        scores: [3, 2, 1],
        type: "text"
    },
    {
        q: "يؤمن الشخص المبتكر بامتلاكه قدرًا كافٍ من المهارات التي تمكنه من الإبداع في التفكير والأداء",
        options: [
            "موافق",
            "غير متأكد",
            "غير موافق",
        ],
        scores: [3, 2, 1],
        type: "text"
    },
    {
        q: "يثق المبدعون بقدرتهم على مشاركة أفكار غير مألوفة مع الآخرين دون تردد مع رهبتهم من النقد",
        options: [
            "موافق",
            "غير متأكد",
            "غير موافق",
        ],
        scores: [3, 2, 1],
        type: "text"
    },
    {
        q: "يقين المتعلم بقدرته على تحويل مواقف الاحباط إلى تجربة تعليمية يمنع توطيد سمة الابداع داخله",
        options: [
            "موافق",
            "غير متأكد",
            "غير موافق",
        ],
        scores: [3, 2, 1],
        type: "text"
    },
    {
        q: "يتمكن الفرد من تطوير أفكاره الإبداعية وتحسين جودتها إذا كان مقتنعا بعلو قيمتها وعمق فائدتها ",
        options: [
            "موافق",
            "غير متأكد",
            "غير موافق",
        ],
        scores: [3, 2, 1],
        type: "text"
    },
    {
        q: "يعبر الإقدام على تجربة فكرة جديدة من المحتمل أن تفشل عن الإيمان بأن الابداع ركيزة شخصية ",
        options: [
            "موافق",
            "غير متأكد",
            "غير موافق",
        ],
        scores: [3, 2, 1],
        type: "text"
    },
    {
        q: "يميل الشخص المبدع لخوض التجارب التي تحفز خياله وتمنحه حرية الابداع مهما كانت معقدة.",
        options: [
            "موافق",
            "غير متأكد",
            "غير موافق",
        ],
        scores: [3, 2, 1],
        type: "text"
    },
    {
        q: "تعوق المغامرة الفكرية صقل الابداع وتخلق بيئة تعلم فاعلة ومشجعة على التجربة والاستكشاف.",
        options: [
            "موافق",
            "غير متأكد",
            "غير موافق",
        ],
        scores: [3, 2, 1],
        type: "text"
    },
    {
        q: "المبادرة بتقديم مقترحات وأفكار جديدة أثناء المناقشات الصفية تسهم في زيادة غموض المعلومة",
        options: [
            "موافق",
            "غير متأكد",
            "غير موافق",
        ],
        scores: [3, 2, 1],
        type: "text"
    },
    {
        q: "يشجع التطوع للعمل بمشروعات تعليمية مفتوحة النهاية على التوصل لنواتج فكرية وأدائية مبتكرة",
        options: [
            "موافق",
            "غير متأكد",
            "غير موافق",
        ],
        scores: [3, 2, 1],
        type: "text"
    },
    {
        q: "تسهم المهام الروتينية المكررة في اشباع الفضول العلمي وزيادة الدافعية نحو التعلم بتفانٍ واقدام.",
        options: [
            "موافق",
            "غير متأكد",
            "غير موافق",
        ],
        scores: [3, 2, 1],
        type: "text"
    },
];